{
    "meta": {
        "title": "Сборник вопросов к практическому зачёту по геоинформатике",
        "task_template": {
            "task": "Текст задания",
            "data": "Ссылка на исходные данные",
            "result": "Ожидаемый результат",
            "tags": ["тег 1", "..."],
            "hide": "true или false (опционально)",
            "author": "Имя автора (опционально)",
            "l": ""
        }
    },
    "tasks": [
        {
            "task": "Какой процент от площади Сатинского полигона находится в 100 м зоне от просёлочных дорог?",
            "data": "",
            "result": "Проект QGIS и значение процента",
            "tags": ["оверлей"]
        },
        {
            "task": "Покажите на карте территорию Сатинского полигона, которая максимально удалена от дорог и водотоков (площадь не менее 5 га)",
            "data": "",
            "result": "Проект QGIS или карта",
            "tags": ["оверлей"]
        },
        {
            "task": "Привяжите топографическую карту на Кинешму таким образом, чтобы она отображалась вверх ногами",
            "data": "",
            "result": "Проект QGIS",
            "tags": ["привязка"]
        },
        {
            "task": "Оцифровать ГЗ. Нанести 3 маршрута от метро до ГЗ. Для каждого маршрута добавить короткое описание. Создать веб-карту с маршрутами и их описаниями. В мелком масштабе маршруты должны исчезать, а ГЗ превращаться в точку.",
            "data": "",
            "result": "Веб-карта (ссылка на веб-страницу)",
            "tags": ["веб-картографирование"]
        },
        {
            "task": "Какой процент поймы (низкой, средней и высокой в совокупности) находится в пределах 20 м зоны от водотоков Сатинского полигона?",
            "data": "",
            "result": "Проект QGIS и значение процента",
            "tags": ["оверлей"]
        },
        {
            "task": "Какой процент подзолистых почв находится в 50 м зоне от асфальтированных дорог?",
            "data": "",
            "result": "Проект QGIS и значение процента",
            "tags": ["оверлей"]
        },
        {
            "task": "Найдите показатель пространственной связи типов землепользования и почв",
            "data": "",
            "result": "Проект QGIS и значение процента",
            "tags": ["оверлей"]
        },
        {
            "task": "Какие почвы и типы рельефа находятся в пределах территории УНБ \"Сатино\" (её придётся оцифровать)",
            "data": "",
            "result": "Проект QGIS и таблица",
            "tags": ["оверлей"]
        },
        {
            "task": "Оцифруйте 8 объектов на территории МГУ (должны быть и точки, и линии, и полигоны). Добавьте в атрибуты название объекта и описание того, почему вы выбрали именно этот объект. Создайте веб-карту с объектами, их названиями и описаниями. В мелком масштабе полигоны должны превращаться в точки.",
            "data": "",
            "result": "Проект QGIS и таблица",
            "tags": ["веб-картографирование"]
        }
    ]
}
