{
    "meta": {
        "title": "Сборник вопросов к практическому зачёту по геоинформатике",
        "task_template": {
            "ID": "Цифробуквенное обозначение",
            "task": "Текст задания",
            "data": "Ссылка на исходные данные",
            "result": "Ожидаемый результат",
            "tags": ["тег 1", "..."],
            "hide": "true или false (опционально)",
            "author": "Имя автора (опционально)",
            "level": "1 - 5",
            "l": ""
        }
    },
    "tasks": [
        {
            "task": "Какой процент от площади Сатинского полигона находится в 100 м зоне от просёлочных дорог? Используйте данные ГИС 'Сатино'.",
            "data": "#",
            "result": "Проект QGIS и значение процента",
            "tags": ["оверлей"],
            "author": "ТГС",
            "level": "3"
        },
        {
            "task": "Покажите на карте территорию Сатинского полигона, которая максимально удалена от дорог и водотоков (площадь не менее 5 га). Используйте данные ГИС 'Сатино'.",
            "data": "#",
            "result": "Проект QGIS или карта",
            "tags": ["оверлей"],
            "author": "ТГС",
            "level": "3"
        },
        {
            "task": "Привяжите топографическую карту на Кинешму таким образом, чтобы она отображалась вверх ногами",
            "data": "#",
            "result": "Проект QGIS",
            "tags": ["привязка"],
            "author": "ТГС",
            "level": "3"
        },
        {
            "task": "Оцифровать ГЗ. Нанести 3 маршрута от метро до ГЗ. Для каждого маршрута добавить короткое описание. Создать веб-карту с маршрутами и их описаниями. В мелком масштабе маршруты должны исчезать, а ГЗ превращаться в точку.",
            "data": "#",
            "result": "Веб-карта (ссылка на веб-страницу)",
            "tags": ["веб-картографирование"],
            "author": "ТГС",
            "level": "3"
        },
        {
            "task": "Какой процент поймы (низкой, средней и высокой в совокупности) находится на удалении не более 20 м от водотоков Сатинского полигона? Используйте данные ГИС 'Сатино'.",
            "data": "#",
            "result": "Проект QGIS и значение процента",
            "tags": ["оверлей"],
            "author": "ТГС",
            "level": "3"
        },
        {
            "task": "Какой процент подзолистых почв находится в 50 м зоне от асфальтированных дорог? Используйте данные ГИС 'Сатино'.",
            "data": "#",
            "result": "Проект QGIS и значение процента",
            "tags": ["оверлей"],
            "author": "ТГС",
            "level": "3"
        },
        {
            "task": "Найдите показатель пространственной связи типов землепользования и почв. Используйте данные ГИС 'Сатино'.",
            "data": "#",
            "result": "Проект QGIS и значение процента",
            "tags": ["оверлей"],
            "author": "ТГС",
            "level": "3"
        },
        {
            "task": "Какие почвы и типы рельефа находятся в пределах территории УНБ \"Сатино\" (её придётся оцифровать). Используйте данные ГИС 'Сатино'.",
            "data": "#",
            "result": "Проект QGIS и таблица",
            "tags": ["оверлей"],
            "author": "ТГС",
            "level": "3"
        },
        {
            "task": "Оцифруйте 8 объектов на территории МГУ (должны быть и точки, и линии, и полигоны). Добавьте в атрибуты название объекта и описание того, почему вы выбрали именно этот объект. Создайте веб-карту с объектами, их названиями и описаниями. В мелком масштабе полигоны должны превращаться в точки.",
            "data": "#",
            "result": "Проект QGIS и таблица",
            "tags": ["веб-картографирование"],
            "author": "ТГС",
            "level": "3"
        },
        {
            "ID": "Tat01",
            "task": "Рассчитать среднее значение показателя в пределах бассейнов и визуализировать в виде карты. . В качестве исходных данных используйте файлы, имя которых начинается на Tat01.",
            "data": "#",
            "result": "Карта",
            "tags": ["оверлей"],
            "author": "КАМ",
            "level": "3"
        },
        {
            "ID": "Tat03",
            "task": "Векторизовать недостающие объекты, рассчитать плотность речной сети в пределах АТД. В качестве исходных данных используйте файлы, имя которых начинается на Tat03.",
            "data": "#",
            "result": "Карта",
            "tags": ["оверлей"],
            "author": "КАМ",
            "level": "3"
        },
        {
            "ID": "Tat04",
            "task": "Векторизовать недостающие реки и рассчитать долю площади территории в пределах единиц АТД, находящихся на расстоянии более чем 3000 м от рек. В качестве исходных данных используйте файлы, имя которых начинается на Tat04.",
            "data": "#",
            "result": "Карта",
            "tags": ["оверлей", "близость"],
            "author": "КАМ",
            "level": "4"
        },
        {
            "ID": "Bali05",
            "task": "Рассчитать среднее значение показателя для рек, находящихся в пределах бассейна. В качестве исходных данных используйте файлы, имя которых начинается на Bali05.",
            "data": "#",
            "result": "Карта",
            "tags": ["оверлей"],
            "author": "КАМ",
            "level": "3"
        },
        {
            "ID": "Bali06",
            "task": "Выбрать реки, расположенные на расстоянии 1 км от точек и присвоить им показатель. В качестве исходных данных используйте файлы, имя которых начинается на Bali06",
            "data": "#",
            "result": "Карта",
            "tags": ["оверлей", "близость"],
            "author": "КАМ",
            "level": "5"
        },
        {
            "ID": "Bali09",
            "task": "Векторизовать недостающие реки и рассчитать долю площади территории в пределах бассейнов, находящихся на расстоянии более чем 200 м от рек. В качестве исходных данных используйте файлы, имя которых начинается на Bali09.",
            "data": "#",
            "result": "Карта",
            "tags": ["оверлей", "близость"],
            "author": "КАМ",
            "level": "3"
        },
        {
            "ID": "Bali12",
            "task": "Рассчитать долю площади территории в пределах бассейнов, находящихся на расстоянии более чем 200 м от рек. В качестве исходных данных используйте файлы, имя которых начинается на Bali12.",
            "data": "#",
            "result": "Карта",
            "tags": ["оверлей", "близость"],
            "author": "КАМ",
            "level": "3"
        },
        {
            "ID": "Kalm19",
            "task": "На изображении указаны массивы леса со средней высотой деревьев. Создайте растровую цифровую модель местности, отражающую высоту рельефа и массивов леса. В качестве исходных данных используйте файлы, имя которых начинается на Kalm19",
            "data": "#",
            "result": "Карта",
            "tags": ["оверлей", "близость"],
            "author": "КАМ",
            "level": "5"
        },
        {
            "task": "Для каждой точки в пределах городской застройки гор. Каспийск рассчитать её удалённость от береговой линии. В качестве исходных данных используйте лист топографической карты K38-048",
            "data": "#",
            "result": "Растр расстояний",
            "tags": ["привязка", "векторизация","близость"],
            "author": "ЭАЛ",
            "level": "3"
        },
        {
            "task": "Для каждой точки в пределах городской застройки гор. Каспийск рассчитать угол наклона по любой доступной цифровой модели рельефа (ЦМР). В качестве исходных данных о застройке гор. Каспийск используйте лист топографической карты K38-048",
            "data": "#",
            "result": "Растр углов наклона",
            "tags": ["привязка", "векторизация","близость"],
            "author": "ЭАЛ",
            "level": "3"
        },
        {
            "task": "Определите соотношение территории и акватории в пределах листа топографической карты K-38-048.",
            "data": "#",
            "result": "Полигональные объекты, соотношение (число)",
            "tags": ["привязка", "векторизация"],
            "author": "ЭАЛ",
            "level": "2"
        },
        {
            "task": "Какая доля площади листа топографической карты N-57-9 НЕ занята ледниками?",
            "data": "#",
            "result": "Полигональные объекты, соотношение (число)",
            "tags": ["привязка", "векторизация"],
            "author": "ЭАЛ",
            "level": "2"
        },
        {
            "task": "Для каждой точки местности в пределах листа топографической карты N-57-9 рассчитайте расстояние до ближайшего ледника.",
            "data": "#",
            "result": "Полигональные объекты, соотношение (число)",
            "tags": ["привязка", "векторизация","близость"],
            "author": "ЭАЛ",
            "level": "3"
        },
        {
            "task": "В Millenium Energy Atlas на карте №50 (файл Millenium_Energy_Atlas_p50.png) зелёной линией показан нефтепровод из Дар-Эс-Салама (Танзания) в Ндолу (Замбия). Вычислите его протяжённость в пределах каждой из стран.",
            "data": "#",
            "result": "Полигональные объекты, соотношение (число)",
            "tags": ["привязка", "векторизация"],
            "author": "ЭАЛ",
            "level": "2"
        },
        {
            "task": "В Millenium Energy Atlas на карте №50 (файл Millenium_Energy_Atlas_p50.png) зелёной линией показан нефтепровод из Дар-Эс-Салама (Танзания) в Ндолу (Замбия). Определите площадь территории, находящейся в зоне радиусом 100 км от этого нефтепровода.",
            "data": "#",
            "result": "Полигональные объекты, соотношение (число)",
            "tags": ["привязка", "векторизация", "близость"],
            "author": "ЭАЛ",
            "level": "2"
        },
        {
            "task": "В Millenium Energy Atlas на карте №70 (файл Millenium_Energy_Atlas_p70.png) значок танкера отмечает нефтеналивные терминалы Новой Зеландии. Для каждой точки Северного острова определите расстояние, на котором находится ближайший к ней терминал.",
            "data": "#",
            "result": "Полигональные объекты, соотношение (число)",
            "tags": ["привязка", "векторизация","близость"],
            "author": "ЭАЛ",
            "level": "3"
        },
        {
            "task": "В Millenium Energy Atlas на карте №70 (файл Millenium_Energy_Atlas_p70.png) красными линиями изображены магистральные газопроводы Новой Зеландии. Определите отношение длины газопроводов к площади Северного острова.",
            "data": "#",
            "result": "Полигональные объекты, соотношение (число)",
            "tags": ["привязка", "векторизация"],
            "author": "ЭАЛ",
            "level": "2"
        }
    ]
}
